{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Even\Desktop\修論STATA\panel data 2011-2015_0530\panel_regression_tobit_0530.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Jun 2020, 21:49:29
{txt}
{com}. 
. 
. use append_0530_3
{txt}(Constructed Children Data for CHARLS Wave 1)

{com}. sort householdid year
{txt}
{com}. xtset householdid year
{res}{txt}{col 8}panel variable:  {res}householdid (strongly balanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2011 to 2015, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. 
. recast double ave_inc 
{txt}
{com}. recast double allreceive_total
{txt}
{com}. recast double nettrsf
{txt}
{com}. recast double allincome
{txt}
{com}. recast double spouse_allincome
{txt}
{com}. recast double mari_status
{txt}
{com}. recast double total_distance
{txt}
{com}. gen ave_visit=total_visit/liveapartnum
{txt}(112 missing values generated)

{com}. gen ave_contact=total_contact/liveapartnum
{txt}(1,203 missing values generated)

{com}. recast double ave_visit 
{txt}
{com}. recast double ave_contact
{txt}
{com}. 
. 
. xtsum householdid year allincome spouse_allincome indv_pension spouse_pension birthyear mari_status allreceive_total allgive_total nettrsf ave_mt max total_visit total_contact livewith total_distance liveapartnum totalincome ave_inc contact_num visit_num

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
househ~d{col 10}overall {c |} {res} 1.79e+09   1.06e+09   1.01e+08   3.48e+09{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 1.06e+09   1.01e+08   3.48e+09{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res}        0   1.79e+09   1.79e+09{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
year{col 10}overall {c |} {res}     2013   1.633086       2011       2015{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res}        0       2013       2013{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 1.633086       2011       2015{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
allinc~e{col 10}overall {c |} {res} 3601.505   25234.05          0    1532000{txt} {c |}{col 69}N =    8424
{col 10}between {c |}{col 31}{res} 16318.52          0   562833.3{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 18998.25  -524231.8   972768.2{txt} {c |} T-bar = 2.86823
{col 18}{c |}{col 63}{c |}
spouse~e{col 10}overall {c |} {res} 3458.307   25140.07          0    1170000{txt} {c |}{col 69}N =    8555
{col 10}between {c |}{col 31}{res} 16617.58          0   416933.3{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 18755.51    -380275     756525{txt} {c |} T-bar = 2.91284
{col 18}{c |}{col 63}{c |}
indv_p~n{col 10}overall {c |} {res} 1965.016   6562.984          0      73200{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 4897.772          0      47640{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 4369.214  -45674.98   44365.02{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
spouse~n{col 10}overall {c |} {res} 968.2971   4692.078          0      84000{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res}  2826.94          0   37833.33{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 3745.106  -32565.04    54968.3{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
birthy~r{col 10}overall {c |} {res} 1949.923   9.280403       1913       1995{txt} {c |}{col 69}N =    8756
{col 10}between {c |}{col 31}{res}  9.23052       1917   1971.667{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 1.135415    1932.59    1984.59{txt} {c |} T-bar = 2.98127
{col 18}{c |}{col 63}{c |}
mari_s~s{col 10}overall {c |} {res} .8111452   .3914155          0          1{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} .3738559          0          1{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} .1160584   .1444785   1.477812{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
allrec~l{col 10}overall {c |} {res} 4279.098   12459.71          0     515000{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 8528.562          0   221666.7{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 9084.298  -217387.6   297612.4{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
allgiv~l{col 10}overall {c |} {res} 2828.119   19473.11          0     800000{txt} {c |}{col 69}N =    8808
{col 10}between {c |}{col 31}{res} 11994.57          0   266666.7{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res}  15340.1  -263838.5   536161.5{txt} {c |} T-bar = 2.99898
{col 18}{c |}{col 63}{c |}
nettrsf{col 10}overall {c |} {res} 1452.437   21853.27    -800000     277700{txt} {c |}{col 69}N =    8808
{col 10}between {c |}{col 31}{res} 14000.06    -266000     132000{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 16789.61  -532547.6   269452.4{txt} {c |} T-bar = 2.99898
{col 18}{c |}{col 63}{c |}
ave_mt{col 10}overall {c |} {res} 2166.099   7011.132          0     257500{txt} {c |}{col 69}N =    7151
{col 10}between {c |}{col 31}{res} 4908.926          0   135833.3{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 4841.523  -133667.2   123832.8{txt} {c |} T-bar =  2.4348
{col 18}{c |}{col 63}{c |}
max{col 10}overall {c |} {res} 2.330269   1.721827          0         10{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 1.231935   .3333333         10{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 1.203067  -4.003064   7.663602{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
total~it{col 10}overall {c |} {res}  228.277   299.1739          0       2972{txt} {c |}{col 69}N =    8699
{col 10}between {c |}{col 31}{res} 254.9297          0   2107.333{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 156.4384  -1109.056   1564.277{txt} {c |} T-bar = 2.96187
{col 18}{c |}{col 63}{c |}
total~ct{col 10}overall {c |} {res} 138.8826    192.947          0       2555{txt} {c |}{col 69}N =    7608
{col 10}between {c |}{col 31}{res} 169.2669          0       2190{txt} {c |}{col 69}n =    2921
{col 10}within  {c |}{col 31}{res} 126.3683  -956.1174   1660.549{txt} {c |} T-bar = 2.60459
{col 18}{c |}{col 63}{c |}
livewith{col 10}overall {c |} {res} .3308365    .470541          0          1{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} .3083162          0          1{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} .3554878  -.3358302   .9975031{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
total_~e{col 10}overall {c |} {res} 3.358189   1.988033          0         18{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 1.748412   .6666667   15.66667{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} .9465872  -2.975145   13.35819{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
liveap~m{col 10}overall {c |} {res} 2.349563   1.322612          1         10{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 1.149149          1   8.333333{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} .6550251   -2.98377   6.349563{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
totali~e{col 10}overall {c |} {res} 77645.91   79943.37          0    1000000{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 63268.16          0   688337.3{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 48877.31  -320679.4   557645.9{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
ave_inc{col 10}overall {c |} {res} 33608.62   29418.87          0     250000{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res}  22818.8          0   208333.3{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} 18571.23  -121391.4   190551.1{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
contac~m{col 10}overall {c |} {res} 2.155033   1.504674          0         10{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 1.245316          0   8.666667{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} .8447385  -2.511633   7.155033{txt} {c |}     T =       3
{col 18}{c |}{col 63}{c |}
visit_~m{col 10}overall {c |} {res} 2.720236   1.465819          0         10{txt} {c |}{col 69}N =    8811
{col 10}between {c |}{col 31}{res} 1.353058   .6666667         10{txt} {c |}{col 69}n =    2937
{col 10}within  {c |}{col 31}{res} .5641584  -1.279764   7.720236{txt} {c |}     T =       3

{com}. 
. gen d2013=0 
{txt}
{com}. replace d2013=1 if year==2013
{txt}(2,937 real changes made)

{com}. 
. gen d2015=0
{txt}
{com}. replace d2015=1 if year==2015
{txt}(2,937 real changes made)

{com}. 
. gen age=2020-birthyear
{txt}(55 missing values generated)

{com}. 
. keep if liveapartnum==max
{txt}(4,772 observations deleted)

{com}. keep if max==visit_num
{txt}(480 observations deleted)

{com}. keep if visit_num==contact_num
{txt}(1,750 observations deleted)

{com}. 
. //drop if allreceive_total==0
. //drop if total_visit==0
. 
. //drop if livewith==1
. 
. egen parents_income=rowtotal(allincome spouse_allincome indv_pension spouse_pension)
{txt}
{com}. 
. 
. 
. //tobit 
. 
. 
. tobit allreceive_total totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-16677.738}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-16677.738}  
Iteration 1:{space 3}log likelihood = {res:-16663.795}  
Iteration 2:{space 3}log likelihood = {res:-16663.618}  
Iteration 3:{space 3}log likelihood = {res:-16663.618}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,696
{txt}{col 49}   Uncensored    {col 67}= {res}     1,528
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       168
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}10{txt}){col 67}= {res}    225.42
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-16663.618{txt}{col 49}Pseudo R2{col 67}= {res}    0.0067

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0470646{col 37}{space 2} .0045524{col 48}{space 1}   10.34{col 57}{space 3}0.000{col 65}{space 4} .0381357{col 78}{space 3} .0559935
{txt}{space 14}allincome {c |}{col 25}{res}{space 2} .0047583{col 37}{space 2}  .006165{col 48}{space 1}    0.77{col 57}{space 3}0.440{col 65}{space 4}-.0073336{col 78}{space 3} .0168502
{txt}{space 7}spouse_allincome {c |}{col 25}{res}{space 2}-.0152652{col 37}{space 2} .0145775{col 48}{space 1}   -1.05{col 57}{space 3}0.295{col 65}{space 4}-.0438571{col 78}{space 3} .0133267
{txt}{space 11}indv_pension {c |}{col 25}{res}{space 2} .3795458{col 37}{space 2} .0561658{col 48}{space 1}    6.76{col 57}{space 3}0.000{col 65}{space 4} .2693838{col 78}{space 3} .4897078
{txt}{space 9}spouse_pension {c |}{col 25}{res}{space 2}-.1336928{col 37}{space 2} .0741318{col 48}{space 1}   -1.80{col 57}{space 3}0.071{col 65}{space 4}-.2790929{col 78}{space 3} .0117073
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2} -1623.93{col 37}{space 2}  532.472{col 48}{space 1}   -3.05{col 57}{space 3}0.002{col 65}{space 4}-2668.306{col 78}{space 3}-579.5542
{txt}{space 20}age {c |}{col 25}{res}{space 2}-62.28616{col 37}{space 2} 44.65409{col 48}{space 1}   -1.39{col 57}{space 3}0.163{col 65}{space 4}-149.8694{col 78}{space 3} 25.29713
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-3116.107{col 37}{space 2} 706.8095{col 48}{space 1}   -4.41{col 57}{space 3}0.000{col 65}{space 4}-4502.423{col 78}{space 3}-1729.791
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-1196.237{col 37}{space 2} 866.6316{col 48}{space 1}   -1.38{col 57}{space 3}0.168{col 65}{space 4}-2896.024{col 78}{space 3} 503.5502
{txt}{space 9}total_distance {c |}{col 25}{res}{space 2}  1071.19{col 37}{space 2} 317.6804{col 48}{space 1}    3.37{col 57}{space 3}0.001{col 65}{space 4} 448.1007{col 78}{space 3}  1694.28
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 5439.117{col 37}{space 2} 2850.951{col 48}{space 1}    1.91{col 57}{space 3}0.057{col 65}{space 4}-152.6577{col 78}{space 3} 11030.89
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.47e+08{col 37}{space 2}  5347320{col 65}{space 4} 1.37e+08{col 78}{space 3} 1.58e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model1
{txt}
{com}. 
. tobit nettrsf totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-15179.522}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-15179.522}  
Iteration 1:{space 3}log likelihood = {res:-15129.241}  
Iteration 2:{space 3}log likelihood = {res:-15127.669}  
Iteration 3:{space 3}log likelihood = {res:-15127.667}  
Iteration 4:{space 3}log likelihood = {res:-15127.667}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,696
{txt}{col 49}   Uncensored    {col 67}= {res}     1,370
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       326
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}10{txt}){col 67}= {res}    185.46
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-15127.667{txt}{col 49}Pseudo R2{col 67}= {res}    0.0061

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         nettrsf{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}totalincome {c |}{col 18}{res}{space 2} .0415909{col 30}{space 2} .0048474{col 41}{space 1}    8.58{col 50}{space 3}0.000{col 58}{space 4} .0320834{col 71}{space 3} .0510985
{txt}{space 7}allincome {c |}{col 18}{res}{space 2} .0054647{col 30}{space 2} .0065171{col 41}{space 1}    0.84{col 50}{space 3}0.402{col 58}{space 4}-.0073177{col 71}{space 3} .0182471
{txt}spouse_allincome {c |}{col 18}{res}{space 2}-.0204083{col 30}{space 2} .0159427{col 41}{space 1}   -1.28{col 50}{space 3}0.201{col 58}{space 4}-.0516778{col 71}{space 3} .0108612
{txt}{space 4}indv_pension {c |}{col 18}{res}{space 2} .3323205{col 30}{space 2} .0602155{col 41}{space 1}    5.52{col 50}{space 3}0.000{col 58}{space 4} .2142155{col 71}{space 3} .4504255
{txt}{space 2}spouse_pension {c |}{col 18}{res}{space 2}-.2210347{col 30}{space 2} .0837148{col 41}{space 1}   -2.64{col 50}{space 3}0.008{col 58}{space 4}-.3852306{col 71}{space 3}-.0568388
{txt}{space 4}liveapartnum {c |}{col 18}{res}{space 2}-1507.093{col 30}{space 2} 566.8513{col 41}{space 1}   -2.66{col 50}{space 3}0.008{col 58}{space 4}-2618.899{col 71}{space 3}-395.2865
{txt}{space 13}age {c |}{col 18}{res}{space 2} 6.349776{col 30}{space 2} 47.63208{col 41}{space 1}    0.13{col 50}{space 3}0.894{col 58}{space 4}-87.07446{col 71}{space 3} 99.77401
{txt}{space 11}d2013 {c |}{col 18}{res}{space 2} -4048.24{col 30}{space 2} 754.7823{col 41}{space 1}   -5.36{col 50}{space 3}0.000{col 58}{space 4}-5528.649{col 71}{space 3}-2567.831
{txt}{space 11}d2015 {c |}{col 18}{res}{space 2}-2959.379{col 30}{space 2} 933.1717{col 41}{space 1}   -3.17{col 50}{space 3}0.002{col 58}{space 4}-4789.676{col 71}{space 3}-1129.082
{txt}{space 2}total_distance {c |}{col 18}{res}{space 2} 1105.551{col 30}{space 2} 339.1919{col 41}{space 1}    3.26{col 50}{space 3}0.001{col 58}{space 4} 440.2695{col 71}{space 3} 1770.832
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 255.9684{col 30}{space 2} 3045.733{col 41}{space 1}    0.08{col 50}{space 3}0.933{col 58}{space 4}-5717.847{col 71}{space 3} 6229.784
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}var(e.nettrsf){c |}{col 18}{res}{space 2} 1.62e+08{col 30}{space 2}  6297161{col 58}{space 4} 1.50e+08{col 71}{space 3} 1.75e+08
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model2
{txt}
{com}. 
. tobit total_visit totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10764.318}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10764.318}  
Iteration 1:{space 3}log likelihood = {res:-10764.177}  
Iteration 2:{space 3}log likelihood = {res:-10764.177}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,689
{txt}{col 49}   Uncensored    {col 67}= {res}     1,673
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        16
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}10{txt}){col 67}= {res}    713.36
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-10764.177{txt}{col 49}Pseudo R2{col 67}= {res}    0.0321

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2}-.0000482{col 32}{space 2} .0000556{col 43}{space 1}   -0.87{col 52}{space 3}0.386{col 60}{space 4}-.0001572{col 73}{space 3} .0000608
{txt}{space 9}allincome {c |}{col 20}{res}{space 2} .0000612{col 32}{space 2}  .000076{col 43}{space 1}    0.81{col 52}{space 3}0.420{col 60}{space 4}-.0000878{col 73}{space 3} .0002102
{txt}{space 2}spouse_allincome {c |}{col 20}{res}{space 2} .0002046{col 32}{space 2} .0001611{col 43}{space 1}    1.27{col 52}{space 3}0.204{col 60}{space 4}-.0001115{col 73}{space 3} .0005206
{txt}{space 6}indv_pension {c |}{col 20}{res}{space 2}   .00195{col 32}{space 2} .0006824{col 43}{space 1}    2.86{col 52}{space 3}0.004{col 60}{space 4} .0006115{col 73}{space 3} .0032884
{txt}{space 4}spouse_pension {c |}{col 20}{res}{space 2}-.0012785{col 32}{space 2} .0009001{col 43}{space 1}   -1.42{col 52}{space 3}0.156{col 60}{space 4}-.0030439{col 73}{space 3} .0004869
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2} 122.1153{col 32}{space 2} 6.533762{col 43}{space 1}   18.69{col 52}{space 3}0.000{col 60}{space 4} 109.3002{col 73}{space 3} 134.9305
{txt}{space 15}age {c |}{col 20}{res}{space 2} 1.632479{col 32}{space 2} .5401808{col 43}{space 1}    3.02{col 52}{space 3}0.003{col 60}{space 4} .5729802{col 73}{space 3} 2.691978
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-118.3511{col 32}{space 2} 8.625677{col 43}{space 1}  -13.72{col 52}{space 3}0.000{col 60}{space 4}-135.2694{col 73}{space 3}-101.4329
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2}-70.36801{col 32}{space 2} 10.52818{col 43}{space 1}   -6.68{col 52}{space 3}0.000{col 60}{space 4}-91.01776{col 73}{space 3}-49.71827
{txt}{space 4}total_distance {c |}{col 20}{res}{space 2}-53.50214{col 32}{space 2} 3.906028{col 43}{space 1}  -13.70{col 52}{space 3}0.000{col 60}{space 4}-61.16333{col 73}{space 3}-45.84094
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-64.20493{col 32}{space 2} 34.52384{col 43}{space 1}   -1.86{col 52}{space 3}0.063{col 60}{space 4}-131.9192{col 73}{space 3} 3.509368
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2} 22364.19{col 32}{space 2} 773.6071{col 60}{space 4} 20897.18{col 73}{space 3} 23934.18
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model3
{txt}
{com}. 
. tobit total_contact totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10741.679}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10741.679}  
Iteration 1:{space 3}log likelihood = {res:-10737.968}  
Iteration 2:{space 3}log likelihood = {res: -10737.96}  
Iteration 3:{space 3}log likelihood = {res: -10737.96}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,689
{txt}{col 49}   Uncensored    {col 67}= {res}     1,607
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        82
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}10{txt}){col 67}= {res}    100.80
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -10737.96{txt}{col 49}Pseudo R2{col 67}= {res}    0.0047

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_contact{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}totalincome {c |}{col 22}{res}{space 2} .0001955{col 34}{space 2} .0000685{col 45}{space 1}    2.86{col 54}{space 3}0.004{col 62}{space 4} .0000612{col 75}{space 3} .0003297
{txt}{space 11}allincome {c |}{col 22}{res}{space 2}  .000062{col 34}{space 2} .0000934{col 45}{space 1}    0.66{col 54}{space 3}0.507{col 62}{space 4}-.0001211{col 75}{space 3} .0002451
{txt}{space 4}spouse_allincome {c |}{col 22}{res}{space 2}-.0000625{col 34}{space 2}  .000198{col 45}{space 1}   -0.32{col 54}{space 3}0.752{col 62}{space 4} -.000451{col 75}{space 3} .0003259
{txt}{space 8}indv_pension {c |}{col 22}{res}{space 2} .0032654{col 34}{space 2} .0008429{col 45}{space 1}    3.87{col 54}{space 3}0.000{col 62}{space 4} .0016122{col 75}{space 3} .0049186
{txt}{space 6}spouse_pension {c |}{col 22}{res}{space 2}  .000364{col 34}{space 2} .0011054{col 45}{space 1}    0.33{col 54}{space 3}0.742{col 62}{space 4}-.0018042{col 75}{space 3} .0025321
{txt}{space 8}liveapartnum {c |}{col 22}{res}{space 2} 38.63798{col 34}{space 2} 8.085159{col 45}{space 1}    4.78{col 54}{space 3}0.000{col 62}{space 4} 22.77992{col 75}{space 3} 54.49603
{txt}{space 17}age {c |}{col 22}{res}{space 2}-3.420813{col 34}{space 2} .6723673{col 45}{space 1}   -5.09{col 54}{space 3}0.000{col 62}{space 4} -4.73958{col 75}{space 3}-2.102047
{txt}{space 15}d2013 {c |}{col 22}{res}{space 2}-30.76445{col 34}{space 2} 10.64996{col 45}{space 1}   -2.89{col 54}{space 3}0.004{col 62}{space 4}-51.65303{col 75}{space 3}-9.875858
{txt}{space 15}d2015 {c |}{col 22}{res}{space 2}-31.87331{col 34}{space 2} 12.99751{col 45}{space 1}   -2.45{col 54}{space 3}0.014{col 62}{space 4}-57.36634{col 75}{space 3}-6.380272
{txt}{space 6}total_distance {c |}{col 22}{res}{space 2}-3.427783{col 34}{space 2}  4.81681{col 45}{space 1}   -0.71{col 54}{space 3}0.477{col 62}{space 4}-12.87537{col 75}{space 3} 6.019802
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 297.6879{col 34}{space 2} 42.90541{col 45}{space 1}    6.94{col 54}{space 3}0.000{col 62}{space 4} 213.5342{col 75}{space 3} 381.8416
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_contact){c |}{col 22}{res}{space 2} 33771.32{col 34}{space 2} 1200.467{col 62}{space 4} 31496.96{col 75}{space 3} 36209.91
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model4
{txt}
{com}. 
. 
. //
. tobit allreceive_total totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-16753.511}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-16753.511}  
Iteration 1:{space 3}log likelihood = {res:-16739.351}  
Iteration 2:{space 3}log likelihood = {res:-16739.169}  
Iteration 3:{space 3}log likelihood = {res:-16739.169}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,705
{txt}{col 49}   Uncensored    {col 67}= {res}     1,535
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       170
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    225.38
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-16739.169{txt}{col 49}Pseudo R2{col 67}= {res}    0.0067

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0465248{col 37}{space 2}  .004522{col 48}{space 1}   10.29{col 57}{space 3}0.000{col 65}{space 4} .0376555{col 78}{space 3} .0553942
{txt}{space 14}allincome {c |}{col 25}{res}{space 2}  .005175{col 37}{space 2} .0061506{col 48}{space 1}    0.84{col 57}{space 3}0.400{col 65}{space 4}-.0068886{col 78}{space 3} .0172385
{txt}{space 7}spouse_allincome {c |}{col 25}{res}{space 2}-.0125613{col 37}{space 2} .0143477{col 48}{space 1}   -0.88{col 57}{space 3}0.381{col 65}{space 4}-.0407024{col 78}{space 3} .0155798
{txt}{space 11}indv_pension {c |}{col 25}{res}{space 2} .3573135{col 37}{space 2} .0542603{col 48}{space 1}    6.59{col 57}{space 3}0.000{col 65}{space 4} .2508893{col 78}{space 3} .4637377
{txt}{space 9}spouse_pension {c |}{col 25}{res}{space 2}-.1322398{col 37}{space 2} .0738809{col 48}{space 1}   -1.79{col 57}{space 3}0.074{col 65}{space 4}-.2771472{col 78}{space 3} .0126675
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2}-1963.134{col 37}{space 2} 480.6903{col 48}{space 1}   -4.08{col 57}{space 3}0.000{col 65}{space 4}-2905.942{col 78}{space 3}-1020.326
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-3015.325{col 37}{space 2} 700.1107{col 48}{space 1}   -4.31{col 57}{space 3}0.000{col 65}{space 4}-4388.496{col 78}{space 3}-1642.153
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-1093.281{col 37}{space 2} 856.3064{col 48}{space 1}   -1.28{col 57}{space 3}0.202{col 65}{space 4}-2772.809{col 78}{space 3} 586.2473
{txt}{space 9}total_distance {c |}{col 25}{res}{space 2} 1188.329{col 37}{space 2} 308.9302{col 48}{space 1}    3.85{col 57}{space 3}0.000{col 65}{space 4} 582.4044{col 78}{space 3} 1794.253
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 1604.916{col 37}{space 2} 771.1516{col 48}{space 1}    2.08{col 57}{space 3}0.038{col 65}{space 4} 92.40741{col 78}{space 3} 3117.425
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.47e+08{col 37}{space 2}  5325814{col 65}{space 4} 1.36e+08{col 78}{space 3} 1.57e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model5
{txt}
{com}. 
. tobit nettrsf totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res: -15244.57}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -15244.57}  
Iteration 1:{space 3}log likelihood = {res:-15194.385}  
Iteration 2:{space 3}log likelihood = {res:-15192.824}  
Iteration 3:{space 3}log likelihood = {res:-15192.822}  
Iteration 4:{space 3}log likelihood = {res:-15192.822}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,705
{txt}{col 49}   Uncensored    {col 67}= {res}     1,376
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       329
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    187.12
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-15192.822{txt}{col 49}Pseudo R2{col 67}= {res}    0.0061

{txt}{hline 17}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}         nettrsf{col 18}{c |}      Coef.{col 30}   Std. Err.{col 42}      t{col 50}   P>|t|{col 58}     [95% Con{col 71}f. Interval]
{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}totalincome {c |}{col 18}{res}{space 2} .0416224{col 30}{space 2} .0048127{col 41}{space 1}    8.65{col 50}{space 3}0.000{col 58}{space 4} .0321829{col 71}{space 3} .0510619
{txt}{space 7}allincome {c |}{col 18}{res}{space 2} .0053956{col 30}{space 2} .0064978{col 41}{space 1}    0.83{col 50}{space 3}0.406{col 58}{space 4}-.0073489{col 71}{space 3}   .01814
{txt}spouse_allincome {c |}{col 18}{res}{space 2}-.0202791{col 30}{space 2} .0157839{col 41}{space 1}   -1.28{col 50}{space 3}0.199{col 58}{space 4} -.051237{col 71}{space 3} .0106788
{txt}{space 4}indv_pension {c |}{col 18}{res}{space 2} .3317546{col 30}{space 2} .0581564{col 41}{space 1}    5.70{col 50}{space 3}0.000{col 58}{space 4} .2176888{col 71}{space 3} .4458203
{txt}{space 2}spouse_pension {c |}{col 18}{res}{space 2}-.2138802{col 30}{space 2} .0833011{col 41}{space 1}   -2.57{col 50}{space 3}0.010{col 58}{space 4} -.377264{col 71}{space 3}-.0504964
{txt}{space 4}liveapartnum {c |}{col 18}{res}{space 2}-1512.349{col 30}{space 2}  510.972{col 41}{space 1}   -2.96{col 50}{space 3}0.003{col 58}{space 4}-2514.551{col 71}{space 3}-510.1473
{txt}{space 11}d2013 {c |}{col 18}{res}{space 2}-4076.353{col 30}{space 2} 747.6881{col 41}{space 1}   -5.45{col 50}{space 3}0.000{col 58}{space 4}-5542.842{col 71}{space 3}-2609.865
{txt}{space 11}d2015 {c |}{col 18}{res}{space 2}-3006.457{col 30}{space 2} 922.4979{col 41}{space 1}   -3.26{col 50}{space 3}0.001{col 58}{space 4}-4815.811{col 71}{space 3}-1197.103
{txt}{space 2}total_distance {c |}{col 18}{res}{space 2} 1130.122{col 30}{space 2} 329.4433{col 41}{space 1}    3.43{col 50}{space 3}0.001{col 58}{space 4} 483.9637{col 71}{space 3}  1776.28
{txt}{space 11}_cons {c |}{col 18}{res}{space 2} 629.1596{col 30}{space 2} 820.2174{col 41}{space 1}    0.77{col 50}{space 3}0.443{col 58}{space 4}-979.5851{col 71}{space 3} 2237.904
{txt}{hline 17}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}var(e.nettrsf){c |}{col 18}{res}{space 2} 1.62e+08{col 30}{space 2}  6262748{col 58}{space 4} 1.50e+08{col 71}{space 3} 1.75e+08
{txt}{hline 17}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model6
{txt}
{com}. 
. tobit total_visit totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10834.938}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10834.938}  
Iteration 1:{space 3}log likelihood = {res:-10834.809}  
Iteration 2:{space 3}log likelihood = {res:-10834.809}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,698
{txt}{col 49}   Uncensored    {col 67}= {res}     1,682
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        16
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    725.97
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-10834.809{txt}{col 49}Pseudo R2{col 67}= {res}    0.0324

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2}-.0000278{col 32}{space 2} .0000557{col 43}{space 1}   -0.50{col 52}{space 3}0.617{col 60}{space 4} -.000137{col 73}{space 3} .0000813
{txt}{space 9}allincome {c |}{col 20}{res}{space 2} .0000517{col 32}{space 2} .0000765{col 43}{space 1}    0.68{col 52}{space 3}0.499{col 60}{space 4}-.0000983{col 73}{space 3} .0002016
{txt}{space 2}spouse_allincome {c |}{col 20}{res}{space 2}  .000158{col 32}{space 2} .0001613{col 43}{space 1}    0.98{col 52}{space 3}0.328{col 60}{space 4}-.0001584{col 73}{space 3} .0004744
{txt}{space 6}indv_pension {c |}{col 20}{res}{space 2} .0024156{col 32}{space 2} .0006655{col 43}{space 1}    3.63{col 52}{space 3}0.000{col 60}{space 4} .0011104{col 73}{space 3} .0037208
{txt}{space 4}spouse_pension {c |}{col 20}{res}{space 2}-.0011347{col 32}{space 2} .0009048{col 43}{space 1}   -1.25{col 52}{space 3}0.210{col 60}{space 4}-.0029092{col 73}{space 3} .0006399
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2}  132.199{col 32}{space 2} 5.969233{col 43}{space 1}   22.15{col 52}{space 3}0.000{col 60}{space 4} 120.4911{col 73}{space 3} 143.9069
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-122.4284{col 32}{space 2} 8.616176{col 43}{space 1}  -14.21{col 52}{space 3}0.000{col 60}{space 4}-139.3279{col 73}{space 3}-105.5289
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2}-75.20041{col 32}{space 2} 10.48458{col 43}{space 1}   -7.17{col 52}{space 3}0.000{col 60}{space 4}-95.76453{col 73}{space 3}-54.63628
{txt}{space 4}total_distance {c |}{col 20}{res}{space 2}-56.42295{col 32}{space 2}  3.83075{col 43}{space 1}  -14.73{col 52}{space 3}0.000{col 60}{space 4}-63.93647{col 73}{space 3}-48.90944
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 33.94453{col 32}{space 2}  9.54289{col 43}{space 1}    3.56{col 52}{space 3}0.000{col 60}{space 4}  15.2274{col 73}{space 3} 52.66167
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2} 22716.35{col 32}{space 2} 783.6003{col 60}{space 4} 21230.26{col 73}{space 3} 24306.46
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model7
{txt}
{com}. 
. tobit total_contact totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10826.027}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10826.027}  
Iteration 1:{space 3}log likelihood = {res:-10822.438}  
Iteration 2:{space 3}log likelihood = {res: -10822.43}  
Iteration 3:{space 3}log likelihood = {res: -10822.43}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,698
{txt}{col 49}   Uncensored    {col 67}= {res}     1,613
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        85
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}     83.97
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -10822.43{txt}{col 49}Pseudo R2{col 67}= {res}    0.0039

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_contact{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}totalincome {c |}{col 22}{res}{space 2}  .000177{col 34}{space 2} .0000697{col 45}{space 1}    2.54{col 54}{space 3}0.011{col 62}{space 4} .0000403{col 75}{space 3} .0003137
{txt}{space 11}allincome {c |}{col 22}{res}{space 2} .0000928{col 34}{space 2} .0000955{col 45}{space 1}    0.97{col 54}{space 3}0.331{col 62}{space 4}-.0000946{col 75}{space 3} .0002802
{txt}{space 4}spouse_allincome {c |}{col 22}{res}{space 2} .0000643{col 34}{space 2} .0002016{col 45}{space 1}    0.32{col 54}{space 3}0.750{col 62}{space 4}-.0003311{col 75}{space 3} .0004596
{txt}{space 8}indv_pension {c |}{col 22}{res}{space 2} .0020716{col 34}{space 2} .0008354{col 45}{space 1}    2.48{col 54}{space 3}0.013{col 62}{space 4} .0004331{col 75}{space 3} .0037101
{txt}{space 6}spouse_pension {c |}{col 22}{res}{space 2} .0002174{col 34}{space 2} .0011299{col 45}{space 1}    0.19{col 54}{space 3}0.847{col 62}{space 4}-.0019988{col 75}{space 3} .0024336
{txt}{space 8}liveapartnum {c |}{col 22}{res}{space 2} 26.28079{col 34}{space 2} 7.519189{col 45}{space 1}    3.50{col 54}{space 3}0.000{col 62}{space 4} 11.53288{col 75}{space 3}  41.0287
{txt}{space 15}d2013 {c |}{col 22}{res}{space 2}-25.24443{col 34}{space 2} 10.81026{col 45}{space 1}   -2.34{col 54}{space 3}0.020{col 62}{space 4}-46.44735{col 75}{space 3} -4.04151
{txt}{space 15}d2015 {c |}{col 22}{res}{space 2} -28.2378{col 34}{space 2} 13.16437{col 45}{space 1}   -2.15{col 54}{space 3}0.032{col 62}{space 4}-54.05799{col 75}{space 3}-2.417605
{txt}{space 6}total_distance {c |}{col 22}{res}{space 2}-.0123705{col 34}{space 2} 4.807484{col 45}{space 1}   -0.00{col 54}{space 3}0.998{col 62}{space 4}-9.441623{col 75}{space 3} 9.416882
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 83.41465{col 34}{space 2} 11.99772{col 45}{space 1}    6.95{col 54}{space 3}0.000{col 62}{space 4} 59.88269{col 75}{space 3} 106.9466
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_contact){c |}{col 22}{res}{space 2} 35460.98{col 34}{space 2} 1259.173{col 62}{space 4} 33075.32{col 75}{space 3} 38018.72
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model8
{txt}
{com}. 
. 
. tobit  allreceive_total totalincome parents_income liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-17573.907}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-17573.907}  
Iteration 1:{space 3}log likelihood = {res:-17557.193}  
Iteration 2:{space 3}log likelihood = {res:-17556.936}  
Iteration 3:{space 3}log likelihood = {res:-17556.935}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,800
{txt}{col 49}   Uncensored    {col 67}= {res}     1,608
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       192
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}    191.57
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-17556.935{txt}{col 49}Pseudo R2{col 67}= {res}    0.0054

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0458539{col 37}{space 2} .0043846{col 48}{space 1}   10.46{col 57}{space 3}0.000{col 65}{space 4} .0372544{col 78}{space 3} .0544535
{txt}{space 9}parents_income {c |}{col 25}{res}{space 2} .0058365{col 37}{space 2}  .005522{col 48}{space 1}    1.06{col 57}{space 3}0.291{col 65}{space 4}-.0049938{col 78}{space 3} .0166667
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2}-2112.322{col 37}{space 2} 518.2244{col 48}{space 1}   -4.08{col 57}{space 3}0.000{col 65}{space 4} -3128.71{col 78}{space 3}-1095.935
{txt}{space 20}age {c |}{col 25}{res}{space 2}  26.0779{col 37}{space 2} 41.67205{col 48}{space 1}    0.63{col 57}{space 3}0.532{col 65}{space 4}-55.65299{col 78}{space 3} 107.8088
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-3086.505{col 37}{space 2} 679.5973{col 48}{space 1}   -4.54{col 57}{space 3}0.000{col 65}{space 4}-4419.391{col 78}{space 3}-1753.619
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-1746.225{col 37}{space 2} 853.0789{col 48}{space 1}   -2.05{col 57}{space 3}0.041{col 65}{space 4}-3419.359{col 78}{space 3}-73.09217
{txt}{space 9}total_distance {c |}{col 25}{res}{space 2} 1281.845{col 37}{space 2} 310.1687{col 48}{space 1}    4.13{col 57}{space 3}0.000{col 65}{space 4} 673.5149{col 78}{space 3} 1890.175
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 446.7184{col 37}{space 2} 2683.949{col 48}{space 1}    0.17{col 57}{space 3}0.868{col 65}{space 4}-4817.278{col 78}{space 3} 5710.715
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.49e+08{col 37}{space 2}  5286212{col 65}{space 4} 1.39e+08{col 78}{space 3} 1.60e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model9
{txt}
{com}. 
. tobit  total_visit totalincome parents_income liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-11399.818}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-11399.818}  
Iteration 1:{space 3}log likelihood = {res:-11399.674}  
Iteration 2:{space 3}log likelihood = {res:-11399.674}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,793
{txt}{col 49}   Uncensored    {col 67}= {res}     1,776
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        17
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}    726.62
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-11399.674{txt}{col 49}Pseudo R2{col 67}= {res}    0.0309

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2}-.0000466{col 32}{space 2} .0000524{col 43}{space 1}   -0.89{col 52}{space 3}0.373{col 60}{space 4}-.0001493{col 73}{space 3} .0000561
{txt}{space 4}parents_income {c |}{col 20}{res}{space 2} .0001044{col 32}{space 2} .0000657{col 43}{space 1}    1.59{col 52}{space 3}0.112{col 60}{space 4}-.0000245{col 73}{space 3} .0002334
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2} 113.7908{col 32}{space 2} 6.210642{col 43}{space 1}   18.32{col 52}{space 3}0.000{col 60}{space 4}   101.61{col 73}{space 3} 125.9717
{txt}{space 15}age {c |}{col 20}{res}{space 2} 1.707516{col 32}{space 2} .4930875{col 43}{space 1}    3.46{col 52}{space 3}0.001{col 60}{space 4} .7404267{col 73}{space 3} 2.674605
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-122.2711{col 32}{space 2}  8.10971{col 43}{space 1}  -15.08{col 52}{space 3}0.000{col 60}{space 4}-138.1766{col 73}{space 3}-106.3655
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2}-74.28436{col 32}{space 2} 10.12892{col 43}{space 1}   -7.33{col 52}{space 3}0.000{col 60}{space 4}-94.15014{col 73}{space 3}-54.41859
{txt}{space 4}total_distance {c |}{col 20}{res}{space 2}-49.66709{col 32}{space 2} 3.723655{col 43}{space 1}  -13.34{col 52}{space 3}0.000{col 60}{space 4}-56.97027{col 73}{space 3}-42.36391
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-58.78197{col 32}{space 2} 31.80423{col 43}{space 1}   -1.85{col 52}{space 3}0.065{col 60}{space 4}-121.1594{col 73}{space 3} 3.595444
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2} 21686.37{col 32}{space 2} 728.1013{col 60}{space 4} 20304.35{col 73}{space 3} 23162.46
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model10
{txt}
{com}. 
. tobit  total_contact totalincome parents_income liveapartnum age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res: -11426.17}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -11426.17}  
Iteration 1:{space 3}log likelihood = {res:-11422.392}  
Iteration 2:{space 3}log likelihood = {res:-11422.384}  
Iteration 3:{space 3}log likelihood = {res:-11422.384}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,793
{txt}{col 49}   Uncensored    {col 67}= {res}     1,707
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        86
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}7{txt}){col 67}= {res}     84.00
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-11422.384{txt}{col 49}Pseudo R2{col 67}= {res}    0.0037

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_contact{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}totalincome {c |}{col 22}{res}{space 2} .0001987{col 34}{space 2} .0000662{col 45}{space 1}    3.00{col 54}{space 3}0.003{col 62}{space 4} .0000689{col 75}{space 3} .0003286
{txt}{space 6}parents_income {c |}{col 22}{res}{space 2} .0000787{col 34}{space 2} .0000829{col 45}{space 1}    0.95{col 54}{space 3}0.343{col 62}{space 4}-.0000839{col 75}{space 3} .0002412
{txt}{space 8}liveapartnum {c |}{col 22}{res}{space 2} 32.81388{col 34}{space 2} 7.880168{col 45}{space 1}    4.16{col 54}{space 3}0.000{col 62}{space 4} 17.35856{col 75}{space 3}  48.2692
{txt}{space 17}age {c |}{col 22}{res}{space 2}-2.784923{col 34}{space 2} .6281229{col 45}{space 1}   -4.43{col 54}{space 3}0.000{col 62}{space 4}-4.016856{col 75}{space 3} -1.55299
{txt}{space 15}d2013 {c |}{col 22}{res}{space 2}-26.26139{col 34}{space 2} 10.27148{col 45}{space 1}   -2.56{col 54}{space 3}0.011{col 62}{space 4}-46.40677{col 75}{space 3}-6.116013
{txt}{space 15}d2015 {c |}{col 22}{res}{space 2} -34.2311{col 34}{space 2} 12.82704{col 45}{space 1}   -2.67{col 54}{space 3}0.008{col 62}{space 4}-59.38868{col 75}{space 3}-9.073517
{txt}{space 6}total_distance {c |}{col 22}{res}{space 2}-1.606675{col 34}{space 2} 4.710765{col 45}{space 1}   -0.34{col 54}{space 3}0.733{col 62}{space 4}-10.84587{col 75}{space 3} 7.632516
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 266.3182{col 34}{space 2} 40.46277{col 45}{space 1}    6.58{col 54}{space 3}0.000{col 62}{space 4} 186.9588{col 75}{space 3} 345.6775
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_contact){c |}{col 22}{res}{space 2} 34457.04{col 34}{space 2} 1188.334{col 62}{space 4} 32203.45{col 75}{space 3} 36868.34
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model11
{txt}
{com}. 
. //
. tobit  allreceive_total totalincome parents_income liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res: -17648.64}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res: -17648.64}  
Iteration 1:{space 3}log likelihood = {res:-17631.724}  
Iteration 2:{space 3}log likelihood = {res:-17631.461}  
Iteration 3:{space 3}log likelihood = {res: -17631.46}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,809
{txt}{col 49}   Uncensored    {col 67}= {res}     1,615
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       194
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}    193.49
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -17631.46{txt}{col 49}Pseudo R2{col 67}= {res}    0.0055

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0461918{col 37}{space 2} .0043505{col 48}{space 1}   10.62{col 57}{space 3}0.000{col 65}{space 4} .0376593{col 78}{space 3} .0547243
{txt}{space 9}parents_income {c |}{col 25}{res}{space 2} .0056815{col 37}{space 2} .0055036{col 48}{space 1}    1.03{col 57}{space 3}0.302{col 65}{space 4}-.0051126{col 78}{space 3} .0164756
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2}-2010.491{col 37}{space 2} 468.1625{col 48}{space 1}   -4.29{col 57}{space 3}0.000{col 65}{space 4}-2928.689{col 78}{space 3}-1092.293
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-3129.766{col 37}{space 2} 673.9108{col 48}{space 1}   -4.64{col 57}{space 3}0.000{col 65}{space 4}-4451.494{col 78}{space 3}-1808.037
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-1836.841{col 37}{space 2}  840.236{col 48}{space 1}   -2.19{col 57}{space 3}0.029{col 65}{space 4} -3484.78{col 78}{space 3}-188.9025
{txt}{space 9}total_distance {c |}{col 25}{res}{space 2} 1262.196{col 37}{space 2} 301.1628{col 48}{space 1}    4.19{col 57}{space 3}0.000{col 65}{space 4}  671.531{col 78}{space 3} 1852.861
{txt}{space 18}_cons {c |}{col 25}{res}{space 2}   2056.2{col 37}{space 2} 756.1649{col 48}{space 1}    2.72{col 57}{space 3}0.007{col 65}{space 4} 573.1481{col 78}{space 3} 3539.251
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.48e+08{col 37}{space 2}  5257128{col 65}{space 4} 1.38e+08{col 78}{space 3} 1.59e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model12
{txt}
{com}. 
. tobit  total_visit totalincome parents_income liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-11472.521}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-11472.521}  
Iteration 1:{space 3}log likelihood = {res:-11472.388}  
Iteration 2:{space 3}log likelihood = {res:-11472.388}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,802
{txt}{col 49}   Uncensored    {col 67}= {res}     1,785
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        17
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}    737.04
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-11472.388{txt}{col 49}Pseudo R2{col 67}= {res}    0.0311

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2}-.0000242{col 32}{space 2} .0000525{col 43}{space 1}   -0.46{col 52}{space 3}0.645{col 60}{space 4} -.000127{col 73}{space 3} .0000787
{txt}{space 4}parents_income {c |}{col 20}{res}{space 2} .0000949{col 32}{space 2} .0000662{col 43}{space 1}    1.43{col 52}{space 3}0.152{col 60}{space 4}-.0000349{col 73}{space 3} .0002248
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2} 124.5645{col 32}{space 2} 5.685778{col 43}{space 1}   21.91{col 52}{space 3}0.000{col 60}{space 4}  113.413{col 73}{space 3} 135.7159
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-126.1604{col 32}{space 2} 8.122903{col 43}{space 1}  -15.53{col 52}{space 3}0.000{col 60}{space 4}-142.0917{col 73}{space 3} -110.229
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2}-80.15614{col 32}{space 2} 10.07212{col 43}{space 1}   -7.96{col 52}{space 3}0.000{col 60}{space 4}-99.91044{col 73}{space 3}-60.40184
{txt}{space 4}total_distance {c |}{col 20}{res}{space 2}-52.94477{col 32}{space 2} 3.651563{col 43}{space 1}  -14.50{col 52}{space 3}0.000{col 60}{space 4}-60.10653{col 73}{space 3}-45.78301
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 44.71113{col 32}{space 2} 9.166561{col 43}{space 1}    4.88{col 52}{space 3}0.000{col 60}{space 4} 26.73289{col 73}{space 3} 62.68938
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2} 22063.49{col 32}{space 2} 738.8141{col 60}{space 4} 20661.02{col 73}{space 3} 23561.15
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model13
{txt}
{com}. 
. tobit  total_contact totalincome parents_income liveapartnum d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-11507.002}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-11507.002}  
Iteration 1:{space 3}log likelihood = {res:-11503.342}  
Iteration 2:{space 3}log likelihood = {res:-11503.335}  
Iteration 3:{space 3}log likelihood = {res:-11503.335}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,802
{txt}{col 49}   Uncensored    {col 67}= {res}     1,713
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        89
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}6{txt}){col 67}= {res}     73.80
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-11503.335{txt}{col 49}Pseudo R2{col 67}= {res}    0.0032

{txt}{hline 21}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_contact{col 22}{c |}      Coef.{col 34}   Std. Err.{col 46}      t{col 54}   P>|t|{col 62}     [95% Con{col 75}f. Interval]
{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}totalincome {c |}{col 22}{res}{space 2} .0001824{col 34}{space 2} .0000671{col 45}{space 1}    2.72{col 54}{space 3}0.007{col 62}{space 4} .0000507{col 75}{space 3}  .000314
{txt}{space 6}parents_income {c |}{col 22}{res}{space 2} .0001055{col 34}{space 2} .0000845{col 45}{space 1}    1.25{col 54}{space 3}0.212{col 62}{space 4}-.0000603{col 75}{space 3} .0002712
{txt}{space 8}liveapartnum {c |}{col 22}{res}{space 2} 22.80095{col 34}{space 2} 7.315307{col 45}{space 1}    3.12{col 54}{space 3}0.002{col 62}{space 4} 8.453544{col 75}{space 3} 37.14836
{txt}{space 15}d2013 {c |}{col 22}{res}{space 2} -22.5215{col 34}{space 2} 10.41199{col 45}{space 1}   -2.16{col 54}{space 3}0.031{col 62}{space 4}-42.94238{col 75}{space 3} -2.10062
{txt}{space 15}d2015 {c |}{col 22}{res}{space 2}-30.03699{col 34}{space 2} 12.91807{col 45}{space 1}   -2.33{col 54}{space 3}0.020{col 62}{space 4}-55.37302{col 75}{space 3}-4.700959
{txt}{space 6}total_distance {c |}{col 22}{res}{space 2} 1.283454{col 34}{space 2} 4.682479{col 45}{space 1}    0.27{col 54}{space 3}0.784{col 62}{space 4}-7.900225{col 75}{space 3} 10.46713
{txt}{space 15}_cons {c |}{col 22}{res}{space 2} 90.34354{col 34}{space 2} 11.77279{col 45}{space 1}    7.67{col 54}{space 3}0.000{col 62}{space 4} 67.25373{col 75}{space 3} 113.4333
{txt}{hline 21}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_contact){c |}{col 22}{res}{space 2} 35939.69{col 34}{space 2} 1238.095{col 62}{space 4} 33591.65{col 75}{space 3} 38451.86
{txt}{hline 21}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model14
{txt}
{com}. 
. 
. tobit allreceive_total totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum total_contact age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-16621.235}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-16621.235}  
Iteration 1:{space 3}log likelihood = {res:-16607.331}  
Iteration 2:{space 3}log likelihood = {res:-16607.159}  
Iteration 3:{space 3}log likelihood = {res:-16607.159}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,689
{txt}{col 49}   Uncensored    {col 67}= {res}     1,523
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       166
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}11{txt}){col 67}= {res}    230.29
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-16607.159{txt}{col 49}Pseudo R2{col 67}= {res}    0.0069

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0463162{col 37}{space 2} .0045665{col 48}{space 1}   10.14{col 57}{space 3}0.000{col 65}{space 4} .0373597{col 78}{space 3} .0552728
{txt}{space 14}allincome {c |}{col 25}{res}{space 2} .0044042{col 37}{space 2} .0061661{col 48}{space 1}    0.71{col 57}{space 3}0.475{col 65}{space 4}-.0076898{col 78}{space 3} .0164983
{txt}{space 7}spouse_allincome {c |}{col 25}{res}{space 2}-.0150891{col 37}{space 2} .0146075{col 48}{space 1}   -1.03{col 57}{space 3}0.302{col 65}{space 4}-.0437399{col 78}{space 3} .0135618
{txt}{space 11}indv_pension {c |}{col 25}{res}{space 2} .3651122{col 37}{space 2} .0564367{col 48}{space 1}    6.47{col 57}{space 3}0.000{col 65}{space 4} .2544184{col 78}{space 3}  .475806
{txt}{space 9}spouse_pension {c |}{col 25}{res}{space 2}-.1356815{col 37}{space 2} .0741517{col 48}{space 1}   -1.83{col 57}{space 3}0.067{col 65}{space 4}-.2811211{col 78}{space 3} .0097582
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2}-1846.642{col 37}{space 2} 540.4262{col 48}{space 1}   -3.42{col 57}{space 3}0.001{col 65}{space 4}-2906.622{col 78}{space 3}-786.6613
{txt}{space 10}total_contact {c |}{col 25}{res}{space 2}  4.23806{col 37}{space 2} 1.680874{col 48}{space 1}    2.52{col 57}{space 3}0.012{col 65}{space 4} .9412283{col 78}{space 3} 7.534891
{txt}{space 20}age {c |}{col 25}{res}{space 2}-50.04164{col 37}{space 2} 44.94465{col 48}{space 1}   -1.11{col 57}{space 3}0.266{col 65}{space 4}-138.1951{col 78}{space 3} 38.11185
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-2957.061{col 37}{space 2}  709.408{col 48}{space 1}   -4.17{col 57}{space 3}0.000{col 65}{space 4}-4348.479{col 78}{space 3}-1565.643
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-1073.011{col 37}{space 2}  868.245{col 48}{space 1}   -1.24{col 57}{space 3}0.217{col 65}{space 4}-2775.968{col 78}{space 3} 629.9461
{txt}{space 9}total_distance {c |}{col 25}{res}{space 2}  1123.66{col 37}{space 2}  320.359{col 48}{space 1}    3.51{col 57}{space 3}0.000{col 65}{space 4} 495.3141{col 78}{space 3} 1752.005
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 4314.146{col 37}{space 2} 2889.917{col 48}{space 1}    1.49{col 57}{space 3}0.136{col 65}{space 4}-1354.076{col 78}{space 3} 9982.367
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.47e+08{col 37}{space 2}  5353384{col 65}{space 4} 1.37e+08{col 78}{space 3} 1.58e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model15
{txt}
{com}. 
. tobit total_visit totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum total_contact age d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10747.131}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10747.131}  
Iteration 1:{space 3}log likelihood = {res:-10746.984}  
Iteration 2:{space 3}log likelihood = {res:-10746.984}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,689
{txt}{col 49}   Uncensored    {col 67}= {res}     1,673
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        16
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}11{txt}){col 67}= {res}    747.75
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-10746.984{txt}{col 49}Pseudo R2{col 67}= {res}    0.0336

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2} -.000068{col 32}{space 2} .0000551{col 43}{space 1}   -1.23{col 52}{space 3}0.217{col 60}{space 4}-.0001761{col 73}{space 3} .0000401
{txt}{space 9}allincome {c |}{col 20}{res}{space 2} .0000536{col 32}{space 2} .0000752{col 43}{space 1}    0.71{col 52}{space 3}0.476{col 60}{space 4}-.0000939{col 73}{space 3} .0002012
{txt}{space 2}spouse_allincome {c |}{col 20}{res}{space 2} .0002123{col 32}{space 2} .0001595{col 43}{space 1}    1.33{col 52}{space 3}0.183{col 60}{space 4}-.0001006{col 73}{space 3} .0005252
{txt}{space 6}indv_pension {c |}{col 20}{res}{space 2} .0015709{col 32}{space 2} .0006786{col 43}{space 1}    2.31{col 52}{space 3}0.021{col 60}{space 4}   .00024{col 73}{space 3} .0029019
{txt}{space 4}spouse_pension {c |}{col 20}{res}{space 2}-.0013073{col 32}{space 2} .0008911{col 43}{space 1}   -1.47{col 52}{space 3}0.143{col 60}{space 4}-.0030551{col 73}{space 3} .0004405
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2} 117.2326{col 32}{space 2} 6.520822{col 43}{space 1}   17.98{col 52}{space 3}0.000{col 60}{space 4} 104.4428{col 73}{space 3} 130.0224
{txt}{space 5}total_contact {c |}{col 20}{res}{space 2} .1198312{col 32}{space 2}  .020334{col 43}{space 1}    5.89{col 52}{space 3}0.000{col 60}{space 4} .0799485{col 73}{space 3} .1597138
{txt}{space 15}age {c |}{col 20}{res}{space 2}  1.97039{col 32}{space 2} .5378273{col 43}{space 1}    3.66{col 52}{space 3}0.000{col 60}{space 4} .9155072{col 73}{space 3} 3.025273
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-114.4125{col 32}{space 2} 8.565607{col 43}{space 1}  -13.36{col 52}{space 3}0.000{col 60}{space 4}-131.2129{col 73}{space 3}-97.61208
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2}-66.46161{col 32}{space 2}   10.444{col 43}{space 1}   -6.36{col 52}{space 3}0.000{col 60}{space 4}-86.94625{col 73}{space 3}-45.97698
{txt}{space 4}total_distance {c |}{col 20}{res}{space 2}-52.79472{col 32}{space 2} 3.868778{col 43}{space 1}  -13.65{col 52}{space 3}0.000{col 60}{space 4}-60.38286{col 73}{space 3}-45.20658
{txt}{space 13}_cons {c |}{col 20}{res}{space 2}-96.50565{col 32}{space 2} 34.61389{col 43}{space 1}   -2.79{col 52}{space 3}0.005{col 60}{space 4}-164.3966{col 73}{space 3} -28.6147
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2} 21916.94{col 32}{space 2} 758.0749{col 60}{space 4} 20479.38{col 73}{space 3} 23455.41
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model16
{txt}
{com}. 
. 
. 
. //
. 
. tobit allreceive_total totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum total_contact d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-16696.598}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-16696.598}  
Iteration 1:{space 3}log likelihood = {res:-16682.496}  
Iteration 2:{space 3}log likelihood = {res:-16682.319}  
Iteration 3:{space 3}log likelihood = {res:-16682.319}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,698
{txt}{col 49}   Uncensored    {col 67}= {res}     1,530
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       168
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}10{txt}){col 67}= {res}    231.04
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-16682.319{txt}{col 49}Pseudo R2{col 67}= {res}    0.0069

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0458217{col 37}{space 2} .0045336{col 48}{space 1}   10.11{col 57}{space 3}0.000{col 65}{space 4} .0369296{col 78}{space 3} .0547139
{txt}{space 14}allincome {c |}{col 25}{res}{space 2} .0047007{col 37}{space 2} .0061508{col 48}{space 1}    0.76{col 57}{space 3}0.445{col 65}{space 4}-.0073633{col 78}{space 3} .0167646
{txt}{space 7}spouse_allincome {c |}{col 25}{res}{space 2}-.0129426{col 37}{space 2} .0143938{col 48}{space 1}   -0.90{col 57}{space 3}0.369{col 65}{space 4}-.0411742{col 78}{space 3}  .015289
{txt}{space 11}indv_pension {c |}{col 25}{res}{space 2} .3467803{col 37}{space 2} .0543773{col 48}{space 1}    6.38{col 57}{space 3}0.000{col 65}{space 4} .2401263{col 78}{space 3} .4534344
{txt}{space 9}spouse_pension {c |}{col 25}{res}{space 2}-.1337313{col 37}{space 2} .0738821{col 48}{space 1}   -1.81{col 57}{space 3}0.070{col 65}{space 4}-.2786415{col 78}{space 3} .0111788
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2}-2149.577{col 37}{space 2} 487.4002{col 48}{space 1}   -4.41{col 57}{space 3}0.000{col 65}{space 4}-3105.549{col 78}{space 3}-1193.605
{txt}{space 10}total_contact {c |}{col 25}{res}{space 2} 4.371902{col 37}{space 2} 1.636742{col 48}{space 1}    2.67{col 57}{space 3}0.008{col 65}{space 4} 1.161645{col 78}{space 3} 7.582158
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-2871.694{col 37}{space 2} 701.9683{col 48}{space 1}   -4.09{col 57}{space 3}0.000{col 65}{space 4}-4248.513{col 78}{space 3}-1494.874
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-980.9432{col 37}{space 2} 857.3362{col 48}{space 1}   -1.14{col 57}{space 3}0.253{col 65}{space 4}-2662.497{col 78}{space 3} 700.6106
{txt}{space 9}total_distance {c |}{col 25}{res}{space 2} 1230.643{col 37}{space 2} 311.5547{col 48}{space 1}    3.95{col 57}{space 3}0.000{col 65}{space 4} 619.5692{col 78}{space 3} 1841.718
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 1237.978{col 37}{space 2}  786.517{col 48}{space 1}    1.57{col 57}{space 3}0.116{col 65}{space 4} -304.673{col 78}{space 3} 2780.629
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.46e+08{col 37}{space 2}  5328998{col 65}{space 4} 1.36e+08{col 78}{space 3} 1.57e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model17
{txt}
{com}. 
. tobit total_visit totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum total_contact d2013 d2015 total_distance, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10815.626}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10815.626}  
Iteration 1:{space 3}log likelihood = {res: -10815.49}  
Iteration 2:{space 3}log likelihood = {res: -10815.49}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,698
{txt}{col 49}   Uncensored    {col 67}= {res}     1,682
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        16
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}10{txt}){col 67}= {res}    764.61
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res} -10815.49{txt}{col 49}Pseudo R2{col 67}= {res}    0.0341

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2}-.0000467{col 32}{space 2} .0000551{col 43}{space 1}   -0.85{col 52}{space 3}0.397{col 60}{space 4}-.0001548{col 73}{space 3} .0000614
{txt}{space 9}allincome {c |}{col 20}{res}{space 2} .0000405{col 32}{space 2} .0000756{col 43}{space 1}    0.54{col 52}{space 3}0.592{col 60}{space 4}-.0001078{col 73}{space 3} .0001888
{txt}{space 2}spouse_allincome {c |}{col 20}{res}{space 2} .0001527{col 32}{space 2} .0001595{col 43}{space 1}    0.96{col 52}{space 3}0.338{col 60}{space 4}-.0001601{col 73}{space 3} .0004656
{txt}{space 6}indv_pension {c |}{col 20}{res}{space 2} .0021407{col 32}{space 2} .0006595{col 43}{space 1}    3.25{col 52}{space 3}0.001{col 60}{space 4} .0008472{col 73}{space 3} .0034342
{txt}{space 4}spouse_pension {c |}{col 20}{res}{space 2}-.0011484{col 32}{space 2} .0008947{col 43}{space 1}   -1.28{col 52}{space 3}0.199{col 60}{space 4}-.0029032{col 73}{space 3} .0006064
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2} 128.2543{col 32}{space 2} 5.935956{col 43}{space 1}   21.61{col 52}{space 3}0.000{col 60}{space 4} 116.6117{col 73}{space 3} 139.8969
{txt}{space 5}total_contact {c |}{col 20}{res}{space 2} .1247685{col 32}{space 2} .0199615{col 43}{space 1}    6.25{col 52}{space 3}0.000{col 60}{space 4} .0856165{col 73}{space 3} .1639205
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-118.8906{col 32}{space 2} 8.539171{col 43}{space 1}  -13.92{col 52}{space 3}0.000{col 60}{space 4} -135.639{col 73}{space 3}-102.1421
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2} -71.5164{col 32}{space 2} 10.38455{col 43}{space 1}   -6.89{col 52}{space 3}0.000{col 60}{space 4}-91.88434{col 73}{space 3}-51.14845
{txt}{space 4}total_distance {c |}{col 20}{res}{space 2}-55.97769{col 32}{space 2} 3.788685{col 43}{space 1}  -14.77{col 52}{space 3}0.000{col 60}{space 4}-63.40871{col 73}{space 3}-48.54668
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 22.44215{col 32}{space 2} 9.616014{col 43}{space 1}    2.33{col 52}{space 3}0.020{col 60}{space 4} 3.581586{col 73}{space 3} 41.30271
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2}  22210.1{col 32}{space 2} 766.0596{col 60}{space 4} 20757.27{col 73}{space 3} 23764.61
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model18
{txt}
{com}. 
. tobit allreceive_total totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum total_contact d2013 d2015, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-16704.361}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-16704.361}  
Iteration 1:{space 3}log likelihood = {res:-16690.259}  
Iteration 2:{space 3}log likelihood = {res:-16690.081}  
Iteration 3:{space 3}log likelihood = {res:-16690.081}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,698
{txt}{col 49}   Uncensored    {col 67}= {res}     1,530
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}       168
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    215.52
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-16690.081{txt}{col 49}Pseudo R2{col 67}= {res}    0.0064

{txt}{hline 24}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       allreceive_total{col 25}{c |}      Coef.{col 37}   Std. Err.{col 49}      t{col 57}   P>|t|{col 65}     [95% Con{col 78}f. Interval]
{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}totalincome {c |}{col 25}{res}{space 2} .0503398{col 37}{space 2} .0044103{col 48}{space 1}   11.41{col 57}{space 3}0.000{col 65}{space 4} .0416896{col 78}{space 3} .0589901
{txt}{space 14}allincome {c |}{col 25}{res}{space 2}  .005325{col 37}{space 2} .0061798{col 48}{space 1}    0.86{col 57}{space 3}0.389{col 65}{space 4} -.006796{col 78}{space 3} .0174459
{txt}{space 7}spouse_allincome {c |}{col 25}{res}{space 2}-.0141478{col 37}{space 2} .0145499{col 48}{space 1}   -0.97{col 57}{space 3}0.331{col 65}{space 4}-.0426855{col 78}{space 3} .0143899
{txt}{space 11}indv_pension {c |}{col 25}{res}{space 2} .3469935{col 37}{space 2} .0546605{col 48}{space 1}    6.35{col 57}{space 3}0.000{col 65}{space 4} .2397841{col 78}{space 3} .4542029
{txt}{space 9}spouse_pension {c |}{col 25}{res}{space 2} -.138161{col 37}{space 2}  .074195{col 48}{space 1}   -1.86{col 57}{space 3}0.063{col 65}{space 4}-.2836849{col 78}{space 3} .0073628
{txt}{space 11}liveapartnum {c |}{col 25}{res}{space 2}-609.1638{col 37}{space 2} 293.8708{col 48}{space 1}   -2.07{col 57}{space 3}0.038{col 65}{space 4}-1185.553{col 78}{space 3}-32.77464
{txt}{space 10}total_contact {c |}{col 25}{res}{space 2} 4.250074{col 37}{space 2} 1.644812{col 48}{space 1}    2.58{col 57}{space 3}0.010{col 65}{space 4} 1.023989{col 78}{space 3} 7.476159
{txt}{space 18}d2013 {c |}{col 25}{res}{space 2}-2433.416{col 37}{space 2} 696.2372{col 48}{space 1}   -3.50{col 57}{space 3}0.000{col 65}{space 4}-3798.994{col 78}{space 3}-1067.837
{txt}{space 18}d2015 {c |}{col 25}{res}{space 2}-556.0482{col 37}{space 2} 854.6057{col 48}{space 1}   -0.65{col 57}{space 3}0.515{col 65}{space 4}-2232.246{col 78}{space 3} 1120.149
{txt}{space 18}_cons {c |}{col 25}{res}{space 2} 1148.613{col 37}{space 2} 790.1751{col 48}{space 1}    1.45{col 57}{space 3}0.146{col 65}{space 4}-401.2126{col 78}{space 3} 2698.438
{txt}{hline 24}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.allreceive_total){c |}{col 25}{res}{space 2} 1.48e+08{col 37}{space 2}  5383221{col 65}{space 4} 1.38e+08{col 78}{space 3} 1.59e+08
{txt}{hline 24}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model19
{txt}
{com}. 
. tobit total_visit totalincome allincome spouse_allincome indv_pension spouse_pension liveapartnum total_contact d2013 d2015, ll(0)
{res}{txt}
Refining starting values:

Grid node 0:{space 3}log likelihood = {res:-10918.397}

Fitting full model:
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-10918.397}  
Iteration 1:{space 3}log likelihood = {res:-10918.275}  
Iteration 2:{space 3}log likelihood = {res:-10918.275}  
{res}
{txt}Tobit regression{col 49}Number of obs{col 67}= {res}     1,698
{txt}{col 49}   Uncensored    {col 67}= {res}     1,682
{txt}Limits: lower = {res}0{txt}{col 49}   Left-censored {col 67}= {res}        16
{txt}        upper = {res}+inf{txt}{col 49}   Right-censored{col 67}= {res}         0

{txt}{col 49}LR chi2({res}9{txt}){col 67}= {res}    559.04
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-10918.275{txt}{col 49}Pseudo R2{col 67}= {res}    0.0250

{txt}{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       total_visit{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}totalincome {c |}{col 20}{res}{space 2}-.0002502{col 32}{space 2} .0000567{col 43}{space 1}   -4.41{col 52}{space 3}0.000{col 60}{space 4}-.0003614{col 73}{space 3} -.000139
{txt}{space 9}allincome {c |}{col 20}{res}{space 2} .0000126{col 32}{space 2} .0000803{col 43}{space 1}    0.16{col 52}{space 3}0.876{col 60}{space 4}-.0001449{col 73}{space 3} .0001701
{txt}{space 2}spouse_allincome {c |}{col 20}{res}{space 2} .0001877{col 32}{space 2} .0001694{col 43}{space 1}    1.11{col 52}{space 3}0.268{col 60}{space 4}-.0001446{col 73}{space 3}   .00052
{txt}{space 6}indv_pension {c |}{col 20}{res}{space 2} .0020903{col 32}{space 2} .0007005{col 43}{space 1}    2.98{col 52}{space 3}0.003{col 60}{space 4} .0007164{col 73}{space 3} .0034642
{txt}{space 4}spouse_pension {c |}{col 20}{res}{space 2}-.0008595{col 32}{space 2} .0009499{col 43}{space 1}   -0.90{col 52}{space 3}0.366{col 60}{space 4}-.0027226{col 73}{space 3} .0010037
{txt}{space 6}liveapartnum {c |}{col 20}{res}{space 2} 57.98827{col 32}{space 2} 3.769574{col 43}{space 1}   15.38{col 52}{space 3}0.000{col 60}{space 4} 50.59474{col 73}{space 3}  65.3818
{txt}{space 5}total_contact {c |}{col 20}{res}{space 2} .1304014{col 32}{space 2}    .0212{col 43}{space 1}    6.15{col 52}{space 3}0.000{col 60}{space 4} .0888203{col 73}{space 3} .1719825
{txt}{space 13}d2013 {c |}{col 20}{res}{space 2}-139.1192{col 32}{space 2} 8.951439{col 43}{space 1}  -15.54{col 52}{space 3}0.000{col 60}{space 4}-156.6763{col 73}{space 3}-121.5622
{txt}{space 13}d2015 {c |}{col 20}{res}{space 2}-91.48445{col 32}{space 2} 10.93496{col 43}{space 1}   -8.37{col 52}{space 3}0.000{col 60}{space 4} -112.932{col 73}{space 3}-70.03695
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 26.97893{col 32}{space 2} 10.20708{col 43}{space 1}    2.64{col 52}{space 3}0.008{col 60}{space 4} 6.959074{col 73}{space 3} 46.99879
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 1}var(e.total_visit){c |}{col 20}{res}{space 2} 25063.06{col 32}{space 2} 864.7359{col 60}{space 4} 23423.11{col 73}{space 3} 26817.83
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. estimates store model20
{txt}
{com}. 
. 
. 
. esttab model1 model2 model3 model4 model5 model6 model7 model8 model9 model10 model11 model12 model13 model14 model15 model16 model17 model18 model19 model20 using result00617_tobit, star(* .1 ** .05 *** .01) csv
{res}{txt}(output written to {browse  `"result00617_tobit.csv"'})

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Even\Desktop\修論STATA\panel data 2011-2015_0530\panel_regression_tobit_0530.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Jun 2020, 21:49:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}